adamkondraciuk/nrfx/mdk/nrf54h20_engb_sysctrl.svd
        <register>
          <name>DIEPTSIZ3</name>
          <description>Device IN Endpoint Transfer Size Register</description>
          <addressOffset>0x970</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>XFERSIZE</name>
              <description>Transfer Size (XferSize)</description>
              <lsb>0</lsb>
              <msb>18</msb>
            </field>
            <field>
              <name>PKTCNT</name>
              <description>Packet Count (PktCnt)</description>
              <lsb>19</lsb>
              <msb>28</msb>
            </field>
            <field>
              <name>MC</name>
              <description>MC</description>
              <lsb>29</lsb>
              <msb>30</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PACKETONE</name>
                  <description>1 packet</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PACKETTWO</name>
                  <description>2 packets</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PACKETTHREE</name>
                  <description>3 packets</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPDMA3</name>
          <description>Device IN Endpoint DMA Address Register</description>
          <addressOffset>0x974</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DMAADDR</name>
              <description>Holds the start address of the external memory for storing or fetching endpoint</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DTXFSTS3</name>
          <description>Device IN Endpoint Transmit FIFO Status Register</description>
          <addressOffset>0x978</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000200</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>INEPTXFSPCAVAIL</name>
              <description>IN Endpoint TxFIFO Space Avail (INEPTxFSpcAvail)</description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIEPCTL4</name>
          <description>Device Control IN Endpoint Control Register</description>
          <addressOffset>0x980</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>MPS</name>
              <description>Maximum Packet Size (MPS)</description>
              <lsb>0</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>USBACTEP</name>
              <description>USB Active Endpoint (USBActEP)</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Not Active</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>USB Active Endpoint</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DPID</name>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DATA0EVENFRM</name>
                  <description>DATA0 or Even Frame</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA1ODDFRM</name>
                  <description>DATA1 or Odd Frame</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NAKSTS</name>
              <description>NAK Status (NAKSts)</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONNAK</name>
                  <description>The core is transmitting non-NAK handshakes based on the FIFO status</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NAK</name>
                  <description>The core is transmitting NAK handshakes on this endpoint</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPTYPE</name>
              <description>Endpoint Type (EPType)</description>
              <lsb>18</lsb>
              <msb>19</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CONTROL</name>
                  <description>Control</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ISOCHRONOUS</name>
                  <description>Isochronous</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BULK</name>
                  <description>Bulk</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTERRUP</name>
                  <description>Interrupt</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STALL</name>
              <description>STALL Handshake (Stall)</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>STALL All non-active tokens</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>STALL All Active Tokens</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXFNUM</name>
              <description>TxFIFO Number (TxFNum)</description>
              <lsb>22</lsb>
              <msb>25</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TXFIFO0</name>
                  <description>Tx FIFO 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFIFO1</name>
                  <description>Tx FIFO 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFIFO2</name>
                  <description>Tx FIFO 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFIFO3</name>
                  <description>Tx FIFO 3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFIFO4</name>
                  <description>Tx FIFO 4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFIFO5</name>
                  <description>Tx FIFO 5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFIFO6</name>
                  <description>Tx FIFO 6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFIFO7</name>
                  <description>Tx FIFO 7</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFIFO8</name>
                  <description>Tx FIFO 8</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFIFO9</name>
                  <description>Tx FIFO 9</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFIFO10</name>
                  <description>Tx FIFO 10</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFIFO11</name>
                  <description>Tx FIFO 11</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFIFO12</name>
                  <description>Tx FIFO 12</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFIFO13</name>
                  <description>Tx FIFO 13</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFIFO14</name>
                  <description>Tx FIFO 14</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXFIFO15</name>
                  <description>Tx FIFO 15</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CNAK</name>
              <description>Clear NAK (CNAK)</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>No Clear NAK</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Clear NAK</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SNAK</name>
              <description>Set NAK (SNAK)</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>No Set NAK</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Set NAK</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETD0PID</name>
              <description>Set DATA0 PID (SetD0PID)</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disables Set DATA0 PID  or Do not force Even (micro)Frame</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Set Endpoint Data PID to DATA0  or Sets EO_FrNum field to Even (micro)Frame</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETD1PID</name>
              <description>Set DATA1 PID (SetD1PID)</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disables Set DATA1 PID  or Do not force Odd (micro)Frame</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Set Endpoint Data PID to DATA1  or Sets EO_FrNum field to Odd (micro)Frame</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPDIS</name>
              <description>Endpoint Disable (EPDis)</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>No Action</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Disable Endpoint</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPENA</name>
              <description>Endpoint Enable (EPEna)</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>No Action</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>Enable Endpoint</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
