adamkondraciuk/nrfx/mdk/nrf54h20_engb_sysctrl.svd
        <cluster>
          <dim>16</dim>
          <dimIncrement>0x1000</dimIncrement>
          <name>DWCOTGDFIFO[%s]</name>
          <description>Unspecified</description>
          <headerStructName>USBHSCORE_DWCOTGDFIFO</headerStructName>
          <access>read-write</access>
          <addressOffset>0x1000</addressOffset>
          <register>
            <dim>0x400</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>DATA[%s]</name>
            <description>Description collection: Data FIFO Access Register Map 0</description>
            <addressOffset>0x0000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
          </register>
        </cluster>
        <cluster>
          <name>DWCOTGDFIFODIRECTACCESS</name>
          <description>Unspecified</description>
          <headerStructName>USBHSCORE_DWCOTGDFIFODIRECTACCESS</headerStructName>
          <access>read-write</access>
          <addressOffset>0x20000</addressOffset>
          <register>
            <dim>0x8000</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>DATA[%s]</name>
            <description>Description collection: Data FIFO Direct Access Register Map</description>
            <addressOffset>0x00000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
          </register>
        </cluster>
      </registers>
    </peripheral>
    <peripheral>
      <name>OICR</name>
      <description>One time programmable Information Configuration Registers</description>
      <baseAddress>0x2F840000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x4000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>OICR</groupName>
      <size>0x20</size>
      <registers>
        <cluster>
          <name>DEVICE</name>
          <description>Unspecified</description>
          <headerStructName>OICR_DEVICE</headerStructName>
          <access>read-writeonce</access>
          <addressOffset>0x000</addressOffset>
          <register>
            <dim>0x4</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>UUID[%s]</name>
            <description>Description collection: 128-bit Universally Unique IDentifier (UUID).</description>
            <addressOffset>0x000</addressOffset>
            <access>read-writeonce</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>UUID</name>
                <description>Device UUID [n].</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TYPE</name>
            <description>Device type.</description>
            <addressOffset>0x010</addressOffset>
            <access>read-writeonce</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TYPE</name>
                <description>Device type.</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Die</name>
                    <description>Device is a physical DIE.</description>
                    <value>0x00000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FPGA</name>
                    <description>Device is a FPGA.</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x8</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>TESTIMPRINT[%s]</name>
            <description>Description collection: Production test imprint.</description>
            <addressOffset>0x014</addressOffset>
            <access>read-writeonce</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TESTIMPRINT</name>
                <description>Production test imprint.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PARTNO</name>
            <description>Part number.</description>
            <addressOffset>0x034</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PART</name>
                <description>Part number.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HWREVISION</name>
            <description>Hardware revision.</description>
            <addressOffset>0x038</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>HWREVISION</name>
                <description>Hardvare revision.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PRODUCTIONREVISION</name>
            <description>Production reversion.</description>
            <addressOffset>0x03C</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PRODUCTIONREVISION</name>
                <description>Production reversion.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>PUF</name>
          <description>Unspecified</description>
          <headerStructName>OICR_PUF</headerStructName>
          <access>read-writeonce</access>
          <addressOffset>0x040</addressOffset>
          <register>
            <name>STATUS</name>
            <description>PUF enrollment status</description>
            <addressOffset>0x000</addressOffset>
            <access>read-writeonce</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>STATUS</name>
                <description>PUF enrollment status.</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Enrolled</name>
                    <description>PUF enrollment has been completed.</description>
                    <value>0x50FA50FA</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NotEnrolled</name>
                    <description>PUF enrollment has not been done.</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>PRECALIB</name>
          <description>Unspecified</description>
          <headerStructName>OICR_PRECALIB</headerStructName>
          <access>read-writeonce</access>
          <addressOffset>0x050</addressOffset>
          <register>
            <name>PRECALIBRDY</name>
            <description>PRECALIB information is populated and ready.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-writeonce</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PRECALIBRDY</name>
                <description>PRECALIB information is populated and ready.</description>
                <lsb>0</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Ready</name>
                    <description>Precalibration information is populated and ready.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NotReady</name>
                    <description>Precalibration information is not populated or ready.</description>
                    <value>0xF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x40</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>ADDRESS[%s]</name>
            <description>Description collection: Address to trim register</description>
            <addressOffset>0x004</addressOffset>
            <access>read-writeonce</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
          </register>
          <register>
            <dim>0x40</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>DATA[%s]</name>
            <description>Description collection: Data for trim register</description>
            <addressOffset>0x104</addressOffset>
            <access>read-writeonce</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
          </register>
        </cluster>
        <cluster>
          <dim>2</dim>
          <dimIncrement>0x04C</dimIncrement>
          <name>MRAM[%s]</name>
          <description>Unspecified</description>
          <headerStructName>OICR_MRAM</headerStructName>
          <access>read-writeonce</access>
          <addressOffset>0x260</addressOffset>
          <register>
            <name>TRIMRDY</name>
            <description>Description cluster: MRAM TRIM information is populated and ready.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-writeonce</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TRIMRDY</name>
                <description>MRAM TRIM information is populated and ready.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Ready</name>
                    <description>Trim information is populated and ready.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NotReady</name>
                    <description>Trim information is not populated or ready.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <cluster>
            <name>LOWAVGCURR</name>
            <description>Unspecified</description>
            <headerStructName>OICR_MRAM_LOWAVGCURR</headerStructName>
            <access>read-writeonce</access>
            <addressOffset>0x004</addressOffset>
            <register>
              <name>READ</name>
              <description>Description cluster: Timeout value for low average current in case of read.</description>
              <addressOffset>0x000</addressOffset>
              <access>read-writeonce</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>VALUE</name>
                  <description>Value</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>WRITE</name>
              <description>Description cluster: Timeout value for low average current in case of write.</description>
              <addressOffset>0x004</addressOffset>
              <access>read-writeonce</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>VALUE</name>
                  <description>Value</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>ERASE</name>
              <description>Description cluster: Timeout value for low average current in case of erase.</description>
              <addressOffset>0x008</addressOffset>
              <access>read-writeonce</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>VALUE</name>
                  <description>Value</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
          </cluster>
          <register>
            <name>WAITSTATES</name>
            <description>Description cluster: Default MRAM[n] waitstates.</description>
            <addressOffset>0x010</addressOffset>
            <access>read-writeonce</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VALUE</name>
                <description>Value</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>READYNEXTTIMEOUT</name>
            <description>Description cluster: Default MRAM[n] READYNEXTTIMEOUT.</description>
            <addressOffset>0x014</addressOffset>
            <access>read-writeonce</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VALUE</name>
                <description>Value</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>NCONFIG</name>
            <description>Description cluster: Number of bits to load from trim configuration for MRAM[n].</description>
            <addressOffset>0x018</addressOffset>
            <access>read-writeonce</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VALUE</name>
                <description>Value</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0xC</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>CONFIG[%s]</name>
            <description>Description collection: MRAM[n] trim configuration.</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-writeonce</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CONFIG</name>
                <description>Trim Configuration [o].</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>UROT</name>
          <description>Unspecified</description>
          <headerStructName>OICR_UROT</headerStructName>
          <access>read-write</access>
          <addressOffset>0x300</addressOffset>
          <register>
            <dim>0x40</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>DATA[%s]</name>
            <description>Description collection: Reserved for updatable RoT data.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DATA</name>
                <description>Data</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>USER</name>
          <description>Unspecified</description>
          <headerStructName>OICR_USER</headerStructName>
          <access>read-writeonce</access>
          <addressOffset>0x400</addressOffset>
          <cluster>
            <name>ROT</name>
            <description>Assets installed to establish initial Root of Trust in the device.</description>
            <headerStructName>OICR_USER_ROT</headerStructName>
            <access>read-writeonce</access>
            <addressOffset>0x000</addressOffset>
            <cluster>
              <dim>3</dim>
              <dimIncrement>0x028</dimIncrement>
              <name>UROTPUBKEY[%s]</name>
              <description>Unspecified</description>
              <headerStructName>OICR_USER_ROT_UROTPUBKEY</headerStructName>
              <access>read-writeonce</access>
              <addressOffset>0x000</addressOffset>
              <register>
                <dim>0x8</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>DIGEST[%s]</name>
                <description>Description collection: First 256 bits of SHA2-512 digest over RoT public key generation [n].</description>
                <addressOffset>0x000</addressOffset>
                <access>read-writeonce</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Value for word [o] in the key digest [n].</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <dim>0x2</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>REVOKE[%s]</name>
                <description>Description collection: Revocation status for public key generation [n].</description>
                <addressOffset>0x020</addressOffset>
                <access>read-writeonce</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>STATUS</name>
                    <description>Revocation status.</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotRevoked</name>
                        <description>Key not revoked.</description>
                        <value>0xFFFFFFFF</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
            </cluster>
            <cluster>
              <dim>3</dim>
              <dimIncrement>0x028</dimIncrement>
              <name>RECOVERYPUBKEY[%s]</name>
              <description>Unspecified</description>
              <headerStructName>OICR_USER_ROT_RECOVERYPUBKEY</headerStructName>
              <access>read-writeonce</access>
              <addressOffset>0x078</addressOffset>
              <register>
                <dim>0x8</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>DIGEST[%s]</name>
                <description>Description collection: First 256 bits of SHA2-512 digest over RoT public key generation [n].</description>
                <addressOffset>0x000</addressOffset>
                <access>read-writeonce</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Value for word [o] in the key digest [n].</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <dim>0x2</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>REVOKE[%s]</name>
                <description>Description collection: Revocation status for public key generation [n].</description>
                <addressOffset>0x020</addressOffset>
                <access>read-writeonce</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>STATUS</name>
                    <description>Revocation status.</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotRevoked</name>
                        <description>Key not revoked.</description>
                        <value>0xFFFFFFFF</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
            </cluster>
            <cluster>
              <dim>3</dim>
              <dimIncrement>0x028</dimIncrement>
              <name>AUTHOPKEY[%s]</name>
              <description>Unspecified</description>
              <headerStructName>OICR_USER_ROT_AUTHOPKEY</headerStructName>
              <access>read-writeonce</access>
              <addressOffset>0x0F0</addressOffset>
              <register>
                <dim>0x8</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>DIGEST[%s]</name>
                <description>Description collection: First 256 bits of SHA2-512 digest over RoT authenticated operation public key generation [n].</description>
                <addressOffset>0x000</addressOffset>
                <access>read-writeonce</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Value for word [o] in the key digest [n].</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
