adamkondraciuk/nrfx/mdk/nrf54h20_engb_sysctrl.svd
              <register>
                <dim>0x2</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>REVOKE[%s]</name>
                <description>Description collection: Revocation status for RoT authenticated operation public key generation [n].</description>
                <addressOffset>0x020</addressOffset>
                <access>read-writeonce</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>STATUS</name>
                    <description>Revocation status.</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotRevoked</name>
                        <description>Key not revoked.</description>
                        <value>0xFFFFFFFF</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
            </cluster>
            <cluster>
              <dim>3</dim>
              <dimIncrement>0x028</dimIncrement>
              <name>AUTHDEBUGKEY[%s]</name>
              <description>Unspecified</description>
              <headerStructName>OICR_USER_ROT_AUTHDEBUGKEY</headerStructName>
              <access>read-writeonce</access>
              <addressOffset>0x168</addressOffset>
              <register>
                <dim>0x8</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>DIGEST[%s]</name>
                <description>Description collection: First 256 bits of SHA2-512 digest over RoT authenticated debug public key generation [n].</description>
                <addressOffset>0x000</addressOffset>
                <access>read-writeonce</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Value for word [o] in the key digest [n].</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <dim>0x2</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>REVOKE[%s]</name>
                <description>Description collection: Revocation status for RoT authenticated debug public key generation [n].</description>
                <addressOffset>0x020</addressOffset>
                <access>read-writeonce</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>STATUS</name>
                    <description>Revocation status.</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotRevoked</name>
                        <description>Key not revoked.</description>
                        <value>0xFFFFFFFF</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
            </cluster>
            <cluster>
              <name>FWENC</name>
              <description>Unspecified</description>
              <headerStructName>OICR_USER_ROT_FWENC</headerStructName>
              <access>read-writeonce</access>
              <addressOffset>0x1E0</addressOffset>
              <cluster>
                <dim>2</dim>
                <dimIncrement>0x020</dimIncrement>
                <name>AES256[%s]</name>
                <description>Unspecified</description>
                <headerStructName>OICR_USER_ROT_FWENC_AES256</headerStructName>
                <access>read-writeonce</access>
                <addressOffset>0x000</addressOffset>
                <register>
                  <dim>0x8</dim>
                  <dimIncrement>0x4</dimIncrement>
                  <name>VALUE[%s]</name>
                  <description>Description collection: RoT AES256 firmware encryption key generation [n].</description>
                  <addressOffset>0x000</addressOffset>
                  <access>read-writeonce</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Value for word [o] in the key value [n].</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
              <cluster>
                <dim>4</dim>
                <dimIncrement>0x010</dimIncrement>
                <name>SM4[%s]</name>
                <description>Unspecified</description>
                <headerStructName>OICR_USER_ROT_FWENC_SM4</headerStructName>
                <access>read-writeonce</access>
                <addressOffset>0x040</addressOffset>
                <register>
                  <dim>0x4</dim>
                  <dimIncrement>0x4</dimIncrement>
                  <name>VALUE[%s]</name>
                  <description>Description collection: RoT SM4 firmware encryption key generation [n].</description>
                  <addressOffset>0x000</addressOffset>
                  <access>read-writeonce</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Value for word [o] in the key value [n].</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
              <cluster>
                <dim>2</dim>
                <dimIncrement>0x020</dimIncrement>
                <name>UROTENC[%s]</name>
                <description>Unspecified</description>
                <headerStructName>OICR_USER_ROT_FWENC_UROTENC</headerStructName>
                <access>read-writeonce</access>
                <addressOffset>0x080</addressOffset>
                <register>
                  <dim>0x8</dim>
                  <dimIncrement>0x4</dimIncrement>
                  <name>VALUE[%s]</name>
                  <description>Description collection: AES256 key for decryption of UROT firmware.</description>
                  <addressOffset>0x000</addressOffset>
                  <access>read-writeonce</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Value for word [o] in the key value [n].</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <register>
              <name>KEYID</name>
              <description>Root of trust key identifier.</description>
              <addressOffset>0x2A0</addressOffset>
              <access>read-writeonce</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>VALUE</name>
                  <description>Root of trust key identifier.</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Unspecified</name>
                      <description>Unspecified</description>
                      <value>0xFFFFFFFF</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <name>POLICY</name>
            <description>ROM enforced device policy</description>
            <headerStructName>OICR_USER_POLICY</headerStructName>
            <access>read-writeonce</access>
            <addressOffset>0x2A4</addressOffset>
            <register>
              <dim>0x8</dim>
              <dimIncrement>0x4</dimIncrement>
              <name>RFU[%s]</name>
              <description>Description collection:</description>
              <addressOffset>0x000</addressOffset>
              <access>read-writeonce</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>RFU</name>
                  <description>Reserved for future use.</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
        <cluster>
          <name>NORDIC</name>
          <description>Unspecified</description>
          <headerStructName>OICR_NORDIC</headerStructName>
          <access>read-writeonce</access>
          <addressOffset>0x700</addressOffset>
          <cluster>
            <name>ROT</name>
            <description>Assets installed to establish initial Root of Trust in the device.</description>
            <headerStructName>OICR_NORDIC_ROT</headerStructName>
            <access>read-writeonce</access>
            <addressOffset>0x000</addressOffset>
            <cluster>
              <dim>3</dim>
              <dimIncrement>0x028</dimIncrement>
              <name>UROTPUBKEY[%s]</name>
              <description>Unspecified</description>
              <headerStructName>OICR_NORDIC_ROT_UROTPUBKEY</headerStructName>
              <access>read-writeonce</access>
              <addressOffset>0x000</addressOffset>
              <register>
                <dim>0x8</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>DIGEST[%s]</name>
                <description>Description collection: First 256 bits of SHA2-512 digest over RoT public key generation [n].</description>
                <addressOffset>0x000</addressOffset>
                <access>read-writeonce</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Value for word [o] in the key digest [n].</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <dim>0x2</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>REVOKE[%s]</name>
                <description>Description collection: Revocation status for public key generation [n].</description>
                <addressOffset>0x020</addressOffset>
                <access>read-writeonce</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>STATUS</name>
                    <description>Revocation status.</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotRevoked</name>
                        <description>Key not revoked.</description>
                        <value>0xFFFFFFFF</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
            </cluster>
            <cluster>
              <dim>3</dim>
              <dimIncrement>0x028</dimIncrement>
              <name>RECOVERYPUBKEY[%s]</name>
              <description>Unspecified</description>
              <headerStructName>OICR_NORDIC_ROT_RECOVERYPUBKEY</headerStructName>
              <access>read-writeonce</access>
              <addressOffset>0x078</addressOffset>
              <register>
                <dim>0x8</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>DIGEST[%s]</name>
                <description>Description collection: First 256 bits of SHA2-512 digest over RoT public key generation [n].</description>
                <addressOffset>0x000</addressOffset>
                <access>read-writeonce</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Value for word [o] in the key digest [n].</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <dim>0x2</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>REVOKE[%s]</name>
                <description>Description collection: Revocation status for public key generation [n].</description>
                <addressOffset>0x020</addressOffset>
                <access>read-writeonce</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>STATUS</name>
                    <description>Revocation status.</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotRevoked</name>
                        <description>Key not revoked.</description>
                        <value>0xFFFFFFFF</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
            </cluster>
            <cluster>
              <dim>3</dim>
              <dimIncrement>0x028</dimIncrement>
              <name>AUTHOPKEY[%s]</name>
              <description>Unspecified</description>
              <headerStructName>OICR_NORDIC_ROT_AUTHOPKEY</headerStructName>
              <access>read-writeonce</access>
              <addressOffset>0x0F0</addressOffset>
              <register>
                <dim>0x8</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>DIGEST[%s]</name>
                <description>Description collection: First 256 bits of SHA2-512 digest over RoT authenticated operation public key generation [n].</description>
                <addressOffset>0x000</addressOffset>
                <access>read-writeonce</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Value for word [o] in the key digest [n].</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <dim>0x2</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>REVOKE[%s]</name>
                <description>Description collection: Revocation status for RoT authenticated operation public key generation [n].</description>
                <addressOffset>0x020</addressOffset>
                <access>read-writeonce</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>STATUS</name>
                    <description>Revocation status.</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotRevoked</name>
                        <description>Key not revoked.</description>
                        <value>0xFFFFFFFF</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
            </cluster>
            <cluster>
              <dim>3</dim>
              <dimIncrement>0x028</dimIncrement>
              <name>AUTHDEBUGKEY[%s]</name>
              <description>Unspecified</description>
              <headerStructName>OICR_NORDIC_ROT_AUTHDEBUGKEY</headerStructName>
              <access>read-writeonce</access>
              <addressOffset>0x168</addressOffset>
              <register>
                <dim>0x8</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>DIGEST[%s]</name>
                <description>Description collection: First 256 bits of SHA2-512 digest over RoT authenticated debug public key generation [n].</description>
                <addressOffset>0x000</addressOffset>
                <access>read-writeonce</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Value for word [o] in the key digest [n].</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <dim>0x2</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>REVOKE[%s]</name>
                <description>Description collection: Revocation status for RoT authenticated debug public key generation [n].</description>
                <addressOffset>0x020</addressOffset>
                <access>read-writeonce</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>STATUS</name>
                    <description>Revocation status.</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotRevoked</name>
                        <description>Key not revoked.</description>
                        <value>0xFFFFFFFF</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
            </cluster>
            <cluster>
              <name>FWENC</name>
              <description>Unspecified</description>
              <headerStructName>OICR_NORDIC_ROT_FWENC</headerStructName>
              <access>read-writeonce</access>
              <addressOffset>0x1E0</addressOffset>
              <cluster>
                <dim>2</dim>
                <dimIncrement>0x020</dimIncrement>
                <name>AES256[%s]</name>
                <description>Unspecified</description>
                <headerStructName>OICR_NORDIC_ROT_FWENC_AES256</headerStructName>
                <access>read-writeonce</access>
                <addressOffset>0x000</addressOffset>
                <register>
                  <dim>0x8</dim>
                  <dimIncrement>0x4</dimIncrement>
                  <name>VALUE[%s]</name>
                  <description>Description collection: RoT AES256 firmware encryption key generation [n].</description>
                  <addressOffset>0x000</addressOffset>
                  <access>read-writeonce</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Value for word [o] in the key value [n].</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
              <cluster>
                <dim>4</dim>
                <dimIncrement>0x010</dimIncrement>
                <name>SM4[%s]</name>
                <description>Unspecified</description>
                <headerStructName>OICR_NORDIC_ROT_FWENC_SM4</headerStructName>
                <access>read-writeonce</access>
                <addressOffset>0x040</addressOffset>
                <register>
                  <dim>0x4</dim>
                  <dimIncrement>0x4</dimIncrement>
                  <name>VALUE[%s]</name>
                  <description>Description collection: RoT SM4 firmware encryption key generation [n].</description>
                  <addressOffset>0x000</addressOffset>
                  <access>read-writeonce</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Value for word [o] in the key value [n].</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
              <cluster>
                <dim>2</dim>
                <dimIncrement>0x020</dimIncrement>
                <name>UROTENC[%s]</name>
                <description>Unspecified</description>
                <headerStructName>OICR_NORDIC_ROT_FWENC_UROTENC</headerStructName>
                <access>read-writeonce</access>
                <addressOffset>0x080</addressOffset>
                <register>
                  <dim>0x8</dim>
                  <dimIncrement>0x4</dimIncrement>
                  <name>VALUE[%s]</name>
                  <description>Description collection: AES256 key for decryption of UROT firmware.</description>
                  <addressOffset>0x000</addressOffset>
                  <access>read-writeonce</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Value for word [o] in the key value [n].</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <register>
              <name>KEYID</name>
              <description>Root of trust key identifier.</description>
              <addressOffset>0x2A0</addressOffset>
              <access>read-writeonce</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>VALUE</name>
                  <description>Root of trust key identifier.</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Unspecified</name>
                      <description>Unspecified</description>
                      <value>0xFFFFFFFF</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
