adamkondraciuk/nrfx/mdk/nrf54h20_engb_sysctrl.svd
          <cluster>
            <name>LCS</name>
            <description>Unspecified</description>
            <headerStructName>OICR_NORDIC_LCS</headerStructName>
            <access>read-writeonce</access>
            <addressOffset>0x2A4</addressOffset>
            <register>
              <dim>0x3</dim>
              <dimIncrement>0x4</dimIncrement>
              <name>FFF[%s]</name>
              <description>Description collection: Life cycle state FFF encoding.</description>
              <addressOffset>0x000</addressOffset>
              <access>read-writeonce</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <size>0x20</size>
            </register>
            <register>
              <dim>0x3</dim>
              <dimIncrement>0x4</dimIncrement>
              <name>DISCARDED[%s]</name>
              <description>Description collection: Life cycle state DISCARDED encoding.</description>
              <addressOffset>0x00C</addressOffset>
              <access>read-writeonce</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <size>0x20</size>
            </register>
            <register>
              <dim>0x3</dim>
              <dimIncrement>0x4</dimIncrement>
              <name>ANALYSIS[%s]</name>
              <description>Description collection: Life cycle state ANALYSIS encoding.</description>
              <addressOffset>0x018</addressOffset>
              <access>read-writeonce</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <size>0x20</size>
            </register>
          </cluster>
          <cluster>
            <name>POLICY</name>
            <description>ROM enforced device policy</description>
            <headerStructName>OICR_NORDIC_POLICY</headerStructName>
            <access>read-writeonce</access>
            <addressOffset>0x2C8</addressOffset>
            <register>
              <name>ERASEONEMPTY</name>
              <description>Policy to disable erasing of MRAMC111 memory on backward
          transition to LCS EMPTY.</description>
              <addressOffset>0x000</addressOffset>
              <access>read-writeonce</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>CONFIG</name>
                  <description>Policy configuration</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>DISABLE</name>
                      <description>Disable erasing MRAMC111 on backward transition to EMPTY.</description>
                      <value>0x72B4E5AC</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <dim>0x9</dim>
              <dimIncrement>0x4</dimIncrement>
              <name>RFU[%s]</name>
              <description>Description collection:</description>
              <addressOffset>0x004</addressOffset>
              <access>read-writeonce</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>RFU</name>
                  <description>Reserved for future use.</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
        <cluster>
          <name>PICR</name>
          <description>Product (paper-spin) Information Configuration Registers</description>
          <headerStructName>OICR_PICR</headerStructName>
          <access>read-write</access>
          <addressOffset>0xA00</addressOffset>
          <register>
            <name>DOMAIN</name>
            <description>Block use of a domain</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ID_0</name>
                <description>Domain identifier of the domain to be blocked</description>
                <lsb>0</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotBlocked</name>
                    <description>Domain not blocked</description>
                    <value>0xF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ID_1</name>
                <description>Domain identifier of the domain to be blocked</description>
                <lsb>4</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotBlocked</name>
                    <description>Domain not blocked</description>
                    <value>0xF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ID_2</name>
                <description>Domain identifier of the domain to be blocked</description>
                <lsb>8</lsb>
                <msb>11</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotBlocked</name>
                    <description>Domain not blocked</description>
                    <value>0xF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ID_3</name>
                <description>Domain identifier of the domain to be blocked</description>
                <lsb>12</lsb>
                <msb>15</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotBlocked</name>
                    <description>Domain not blocked</description>
                    <value>0xF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ID_4</name>
                <description>Domain identifier of the domain to be blocked</description>
                <lsb>16</lsb>
                <msb>19</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotBlocked</name>
                    <description>Domain not blocked</description>
                    <value>0xF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ID_5</name>
                <description>Domain identifier of the domain to be blocked</description>
                <lsb>20</lsb>
                <msb>23</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotBlocked</name>
                    <description>Domain not blocked</description>
                    <value>0xF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ID_6</name>
                <description>Domain identifier of the domain to be blocked</description>
                <lsb>24</lsb>
                <msb>27</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotBlocked</name>
                    <description>Domain not blocked</description>
                    <value>0xF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ID_7</name>
                <description>Domain identifier of the domain to be blocked</description>
                <lsb>28</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotBlocked</name>
                    <description>Domain not blocked</description>
                    <value>0xF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <cluster>
            <dim>8</dim>
            <dimIncrement>0x008</dimIncrement>
            <name>MEM[%s]</name>
            <description>Unspecified</description>
            <headerStructName>OICR_PICR_MEM</headerStructName>
            <access>read-write</access>
            <addressOffset>0x010</addressOffset>
            <register>
              <name>ADDR</name>
              <description>Description cluster: Start address of the memory to be blocked</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>ADDR</name>
                  <description>Memory start address</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NotBlocked</name>
                      <description>Memory not blocked</description>
                      <value>0xFFFFFFFF</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>SIZE</name>
              <description>Description cluster: Size of the memory to be blocked</description>
              <addressOffset>0x004</addressOffset>
              <access>read-write</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>SIZE</name>
                  <description>Memory size in bytes</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <dim>8</dim>
            <dimIncrement>0x008</dimIncrement>
            <name>PERIPH[%s]</name>
            <description>Unspecified</description>
            <headerStructName>OICR_PICR_PERIPH</headerStructName>
            <access>read-write</access>
            <addressOffset>0x050</addressOffset>
            <register>
              <name>ADDR</name>
              <description>Description cluster: Start address of the peripheral to be blocked</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>ADDR</name>
                  <description>Peripheral start address</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NotBlocked</name>
                      <description>Peripheral not blocked</description>
                      <value>0xFFFFFFFF</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>SIZE</name>
              <description>Description cluster: Number of peripherals to be blocked</description>
              <addressOffset>0x004</addressOffset>
              <access>read-write</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>SIZE</name>
                  <description>Peripheral size in 4Kbytes.</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
          </cluster>
          <register>
            <dim>0x20</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>GPIO[%s]</name>
            <description>Description collection: GPIO configuration to block a pin or port</description>
            <addressOffset>0x090</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PORT</name>
                <description>Port number</description>
                <lsb>8</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>ENABLE</name>
                <description>Enable blocking</description>
                <lsb>12</lsb>
                <msb>13</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>PinBlock</name>
                    <description>GPIO pin block is enabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PortBlock</name>
                    <description>Enable blocking a whole port</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>GPIO pin block is disabled</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>FWPATCH</name>
          <description>Unspecified</description>
          <headerStructName>OICR_FWPATCH</headerStructName>
          <access>read-writeonce</access>
          <addressOffset>0xC00</addressOffset>
          <cluster>
            <name>SYSCTRL</name>
            <description>Unspecified</description>
            <headerStructName>OICR_FWPATCH_SYSCTRL</headerStructName>
            <access>read-writeonce</access>
            <addressOffset>0x000</addressOffset>
            <register>
              <dim>0x8</dim>
              <dimIncrement>0x4</dimIncrement>
              <name>PATCHADDR[%s]</name>
              <description>Description collection: Patch address for SysCtrl ROM patch entry point n.</description>
              <addressOffset>0x000</addressOffset>
              <access>read-writeonce</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>ADDR</name>
                  <description>Address</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
            <register>
              <dim>0x8</dim>
              <dimIncrement>0x4</dimIncrement>
              <name>TRAPADDR[%s]</name>
              <description>Description collection: Addresses in SysCtrl ROM which will be trapped to the PATCHADDR target.</description>
              <addressOffset>0x020</addressOffset>
              <access>read-writeonce</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>ADDR</name>
                  <description>Address</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <name>SECROM</name>
            <description>Unspecified</description>
            <headerStructName>OICR_FWPATCH_SECROM</headerStructName>
            <access>read-writeonce</access>
            <addressOffset>0x040</addressOffset>
            <register>
              <dim>0xE0</dim>
              <dimIncrement>0x4</dimIncrement>
              <name>PATCHADDR[%s]</name>
              <description>Description collection: Patch address for secure domain ROM patch entry point n.</description>
              <addressOffset>0x000</addressOffset>
              <access>read-writeonce</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>ADDR</name>
                  <description>Address</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
          </cluster>
          <register>
            <dim>0xC10</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>PATCHCODE[%s]</name>
            <description>Description collection: Patch code area. The code area is shared through mutual agreement between SysCtrl ROM and Secure Domain ROM.</description>
            <addressOffset>0x3C0</addressOffset>
            <access>read-writeonce</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DATA</name>
                <description>Data</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
