adamkondraciuk/nrfx/mdk/nrf54h20_engb_sysctrl.svd
            <register>
              <name>STATUSDSTTRAN</name>
              <description>Channel destination transaction complete interrupt event from all channels is stored in this Interrupt Status register after masking.</description>
              <addressOffset>0x040</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>STATUS</name>
                  <description>Status for IntDstTran Interrupt</description>
                  <lsb>0</lsb>
                  <msb>1</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>STATUSERR</name>
              <description>Channel Error interrupt event from all channels is stored in this Interrupt Status register after masking.</description>
              <addressOffset>0x048</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>STATUS</name>
                  <description>Status for IntErr Interrupt</description>
                  <lsb>0</lsb>
                  <msb>1</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>MASKTFR</name>
              <description>The contents of the Raw Status register RawTfr is masked with the contents of the Mask register MaskTfr.</description>
              <addressOffset>0x050</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>INTMASK</name>
                  <description>Mask for IntTfr Interrupt</description>
                  <lsb>0</lsb>
                  <msb>1</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>MASK</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>UNMASK</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RSVDMASKTFR</name>
                  <description>Reserved field - read-only</description>
                  <lsb>2</lsb>
                  <msb>7</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>INTMASKWE</name>
                  <description>Interrupt Mask Write Enable</description>
                  <lsb>8</lsb>
                  <msb>9</msb>
                  <access>write-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>DISABLED</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ENABLED</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>MASKBLOCK</name>
              <description>The contents of the Raw Status register RawBlock is masked with the contents of the Mask register MaskBlock.</description>
              <addressOffset>0x058</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>INTMASK</name>
                  <description>Mask for IntBlock Interrupt</description>
                  <lsb>0</lsb>
                  <msb>1</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>MASK</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>UNMASK</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RSVDMASKBLOCK</name>
                  <description>Reserved field- read-only</description>
                  <lsb>2</lsb>
                  <msb>7</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>INTMASKWE</name>
                  <description>Interrupt Mask Write Enable</description>
                  <lsb>8</lsb>
                  <msb>9</msb>
                  <access>write-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>DISABLED</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ENABLED</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>MASKSRCTRAN</name>
              <description>The contents of the Raw Status register RawSrcTran is masked with the contents of the Mask register MaskSrcTran.</description>
              <addressOffset>0x060</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>INTMASK</name>
                  <description>Mask for IntSrcTran Interrupt</description>
                  <lsb>0</lsb>
                  <msb>1</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>MASK</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>UNMASK</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RSVDMASKSRCTRAN</name>
                  <description>Reserved field- read-only</description>
                  <lsb>2</lsb>
                  <msb>7</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>INTMASKWE</name>
                  <description>Interrupt Mask Write Enable</description>
                  <lsb>8</lsb>
                  <msb>9</msb>
                  <access>write-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>DISABLED</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ENABLED</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>MASKDSTTRAN</name>
              <description>The contents of the Raw Status register RawDstTran is masked with the contents of the Mask register MaskDstTran.</description>
              <addressOffset>0x068</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>INTMASK</name>
                  <description>Mask for IntDstTran Interrupt</description>
                  <lsb>0</lsb>
                  <msb>1</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>MASK</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>UNMASK</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RSVDMASKDSTTRAN</name>
                  <description>Reserved field - read-only</description>
                  <lsb>2</lsb>
                  <msb>7</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>INTMASKWE</name>
                  <description>Interrupt Mask Write Enable</description>
                  <lsb>8</lsb>
                  <msb>9</msb>
                  <access>write-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>DISABLED</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ENABLED</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>MASKERR</name>
              <description>The contents of the Raw Status register RawErr is masked with the contents of the Mask register MaskErr.</description>
              <addressOffset>0x070</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>INTMASK</name>
                  <description>Mask for IntErr Interrupt</description>
                  <lsb>0</lsb>
                  <msb>1</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>MASK</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>UNMASK</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RSVDMASKERR</name>
                  <description>Reserved field- read-only</description>
                  <lsb>2</lsb>
                  <msb>7</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>INTMASKWE</name>
                  <description>Interrupt Mask Write Enable</description>
                  <lsb>8</lsb>
                  <msb>9</msb>
                  <access>write-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>DISABLED</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ENABLED</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>CLEARTFR</name>
              <description>Each bit in the RawTfr and StatusTfr is cleared on the same cycle by writing a 1 to the corresponding location in the this registers.</description>
              <addressOffset>0x078</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>CLEAR</name>
                  <description>Clear for IntTfr Interrupt</description>
                  <lsb>0</lsb>
                  <msb>1</msb>
                  <access>write-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NOT_CLEAR</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>CLEAR</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>CLEARBLOCK</name>
              <description>Each bit in the RawBlock and StatusBlock is cleared on the same cycle by writing a 1 to the corresponding location in the this registers.</description>
              <addressOffset>0x080</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>CLEAR</name>
                  <description>Clear for IntBlock Interrupt</description>
                  <lsb>0</lsb>
                  <msb>1</msb>
                  <access>write-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>CLEARSRCTRAN</name>
              <description>Each bit in the RawSrcTran and StatusSrcTran is cleared on the same cycle by writing a 1 to the corresponding location in the this registers.</description>
              <addressOffset>0x088</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>CLEAR</name>
                  <description>Clear for IntSrcTran Interrupt</description>
                  <lsb>0</lsb>
                  <msb>1</msb>
                  <access>write-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NOT_CLEAR</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>CLEAR</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>CLEARDSTTRAN</name>
              <description>Each bit in the RawDstTran and StatusDstTran is cleared on the same cycle by writing a 1 to the corresponding location in the this registers.</description>
              <addressOffset>0x090</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>CLEAR</name>
                  <description>Clear for IntDstTran Interrupt</description>
                  <lsb>0</lsb>
                  <msb>1</msb>
                  <access>write-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NOT_CLEAR</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>CLEAR</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>CLEARERR</name>
              <description>Each bit in the RawErr and StatusErr is cleared on the same cycle by writing a 1 to the corresponding location in the this registers.</description>
              <addressOffset>0x098</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>CLEAR</name>
                  <description>Clear for IntErr Interrupt</description>
                  <lsb>0</lsb>
                  <msb>1</msb>
                  <access>write-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NOT_CLEAR</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>CLEAR</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
