adamkondraciuk/nrfx/mdk/nrf54h20_engb_sysctrl.svd
        <cluster>
          <name>TRANSACTION</name>
          <description>Information about the currently processed transaction</description>
          <headerStructName>EXMEE_TRANSACTION</headerStructName>
          <access>read-write</access>
          <addressOffset>0x530</addressOffset>
          <register>
            <name>ADDRESS</name>
            <description>Target address in external memory of the currently processed AXI transaction</description>
            <addressOffset>0x000</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ADDRESS</name>
                <description>Address in EXMIF</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x2</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>COUNTER[%s]</name>
            <description>Description collection: 64 bit write counter</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>COUNTER</name>
                <description>The n-th word of the 64 bit counter value</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x4</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>PLAINTEXT[%s]</name>
            <description>Description collection: 128 bit plaintext register.</description>
            <addressOffset>0x010</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WORD</name>
                <description>The n-th word of the 128 bit plaintext input</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x4</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>CIPHERTEXT[%s]</name>
            <description>Description collection: 128 bit ciphertext register.</description>
            <addressOffset>0x020</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WORD</name>
                <description>The n-th word of the 128 bit ciphertext input</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x4</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>NONCE[%s]</name>
            <description>Description collection: 128 bit nonce register.</description>
            <addressOffset>0x030</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WORD</name>
                <description>The n-th word of the 128 bit nonce input</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>16</dim>
          <dimIncrement>0x020</dimIncrement>
          <name>REGION[%s]</name>
          <description>Encryption region n</description>
          <headerStructName>EXMEE_REGION</headerStructName>
          <access>read-write</access>
          <addressOffset>0x600</addressOffset>
          <register>
            <name>START</name>
            <description>Description cluster: Start offset relative to memory window for encryption region n</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>OFFSET</name>
                <description>Start offset of encryption region</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>END</name>
            <description>Description cluster: End offset relative to memory window for encryption region n</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>OFFSET</name>
                <description>End offset of encryption region</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>COUNTER</name>
            <description>Description cluster: Address offset where the write counters for encryption region n should be stored</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>OFFSET</name>
                <description>Counter offset of encryption region</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>NONCEMODE</name>
            <description>Description cluster: Nonce mode for encryption region n</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MODE</name>
                <description>Nonce mode for encryption region. This register enables the EVENTS_NONCEREADY to TASKS_START shortcut</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>AUTO</name>
                    <description>EXMEE does not wait before reading NONCE register</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>WAIT</name>
                    <description>EXMEE waits for TASKS_START before reading NONCE register</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x4</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>KEY[%s]</name>
            <description>Description collection: 128b key for encryption region n</description>
            <addressOffset>0x010</addressOffset>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WORD</name>
                <description>The o-th word of the 128b key</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
