adamkondraciuk/nrfx/mdk/nrf54h20_engb_sysctrl.svd
        <register>
          <name>ORC</name>
          <description>Byte transmitted after TXD.MAXCNT bytes have been transmitted in the case when RXD.MAXCNT is greater than TXD.MAXCNT</description>
          <addressOffset>0x5C0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ORC</name>
              <description>Byte transmitted after TXD.MAXCNT bytes have been transmitted in the case when RXD.MAXCNT is greater than TXD.MAXCNT.</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <cluster>
          <name>PSEL</name>
          <description>Unspecified</description>
          <headerStructName>SPIM_PSEL</headerStructName>
          <access>read-write</access>
          <addressOffset>0x600</addressOffset>
          <register>
            <name>SCK</name>
            <description>Pin select for SCK</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PORT</name>
                <description>Port number</description>
                <lsb>5</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>MOSI</name>
            <description>Pin select for MOSI signal</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PORT</name>
                <description>Port number</description>
                <lsb>5</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>MISO</name>
            <description>Pin select for MISO signal</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PORT</name>
                <description>Port number</description>
                <lsb>5</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DCX</name>
            <description>Pin select for DCX signal</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PORT</name>
                <description>Port number</description>
                <lsb>5</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x1</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>CSN[%s]</name>
            <description>Description collection: Pin select for CSN</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>PORT</name>
                <description>Port number</description>
                <lsb>5</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>DMA</name>
          <description>Unspecified</description>
          <headerStructName>SPIM_DMA</headerStructName>
          <access>read-write</access>
          <addressOffset>0x700</addressOffset>
          <cluster>
            <name>RX</name>
            <description>Unspecified</description>
            <headerStructName>SPIM_DMA_RX</headerStructName>
            <access>read-write</access>
            <addressOffset>0x000</addressOffset>
            <register>
              <name>ENABLE</name>
              <description>Register doesn't do anything. Can be written and read, but has no functionality attached.</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>ENABLE</name>
                  <description>Register doesn't do anything. Can be written and read, but has no functionality attached.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Disable</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Enable</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>PTR</name>
              <description>RAM buffer start address</description>
              <addressOffset>0x004</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>PTR</name>
                  <description>RAM buffer start address for this EasyDMA channel. This address is a word aligned Data RAM address.</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>MAXCNT</name>
              <description>Maximum number of bytes in channel buffer</description>
              <addressOffset>0x008</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>MAXCNT</name>
                  <description>Maximum number of bytes in channel buffer</description>
                  <lsb>0</lsb>
                  <msb>15</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>AMOUNT</name>
              <description>Number of bytes transferred in the last transaction, updated after the END event. Also updated after each MATCH event.</description>
              <addressOffset>0x00C</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>AMOUNT</name>
                  <description>Number of bytes transferred in the last transaction. In case of NACK error, includes the NACK'ed byte.</description>
                  <lsb>0</lsb>
                  <msb>15</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>CURRENTAMOUNT</name>
              <description>Number of bytes transferred in the current transaction</description>
              <addressOffset>0x010</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>AMOUNT</name>
                  <description>Number of bytes transferred in the current transaction. Continuously updated. Updated when data leaves the internal FIFO and is transferred to the destination.</description>
                  <lsb>0</lsb>
                  <msb>15</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>LIST</name>
              <description>EasyDMA list type</description>
              <addressOffset>0x014</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>TYPE</name>
                  <description>List type</description>
                  <lsb>0</lsb>
                  <msb>2</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Disable EasyDMA list</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ArrayList</name>
                      <description>Use array list</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>TERMINATEONBUSERROR</name>
              <description>Terminate the transaction if a BUSERROR event is detected.</description>
              <addressOffset>0x01C</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>ENABLE</name>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Disable</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Enable</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>BUSERRORADDRESS</name>
              <description>Address of transaction that generated the last BUSERROR event.</description>
              <addressOffset>0x020</addressOffset>
              <access>read-only</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>ADDRESS</name>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
            <cluster>
              <name>MATCH</name>
              <description>Registers to control the behavior of the pattern matcher engine</description>
              <headerStructName>SPIM_DMA_RX_MATCH</headerStructName>
              <access>read-write</access>
              <addressOffset>0x024</addressOffset>
              <register>
                <name>CONFIG</name>
                <description>Configure individual match events</description>
                <addressOffset>0x000</addressOffset>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>ENABLE_0</name>
                    <description>Enable match filter 0</description>
                    <lsb>0</lsb>
                    <msb>0</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Disabled</name>
                        <description>Match filter disabled</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Enabled</name>
                        <description>Match filter enabled</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>ENABLE_1</name>
                    <description>Enable match filter 1</description>
                    <lsb>1</lsb>
                    <msb>1</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Disabled</name>
                        <description>Match filter disabled</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Enabled</name>
                        <description>Match filter enabled</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>ENABLE_2</name>
                    <description>Enable match filter 2</description>
                    <lsb>2</lsb>
                    <msb>2</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Disabled</name>
                        <description>Match filter disabled</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Enabled</name>
                        <description>Match filter enabled</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>ENABLE_3</name>
                    <description>Enable match filter 3</description>
                    <lsb>3</lsb>
                    <msb>3</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Disabled</name>
                        <description>Match filter disabled</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Enabled</name>
                        <description>Match filter enabled</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>ONESHOT_0</name>
                    <description>Configure match filter 0 as one-shot or sticky</description>
                    <lsb>16</lsb>
                    <msb>16</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Continuous</name>
                        <description>Match filter stays enabled until disabled by task</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Oneshot</name>
                        <description>Match filter stays enabled until next data word is received</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>ONESHOT_1</name>
                    <description>Configure match filter 1 as one-shot or sticky</description>
                    <lsb>17</lsb>
                    <msb>17</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Continuous</name>
                        <description>Match filter stays enabled until disabled by task</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Oneshot</name>
                        <description>Match filter stays enabled until next data word is received</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>ONESHOT_2</name>
                    <description>Configure match filter 2 as one-shot or sticky</description>
                    <lsb>18</lsb>
                    <msb>18</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Continuous</name>
                        <description>Match filter stays enabled until disabled by task</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Oneshot</name>
                        <description>Match filter stays enabled until next data word is received</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>ONESHOT_3</name>
                    <description>Configure match filter 3 as one-shot or sticky</description>
                    <lsb>19</lsb>
                    <msb>19</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Continuous</name>
                        <description>Match filter stays enabled until disabled by task</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Oneshot</name>
                        <description>Match filter stays enabled until next data word is received</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
              <register>
                <dim>0x4</dim>
                <dimIncrement>0x4</dimIncrement>
                <name>CANDIDATE[%s]</name>
                <description>Description collection: The data to look for - any match will trigger the MATCH[n] event, if enabled.</description>
                <addressOffset>0x004</addressOffset>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>DATA</name>
                    <description>Data to look for</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
            </cluster>
          </cluster>
