adamkondraciuk/nrfx/mdk/nrf54h20_engb_sysctrl.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="PCGCS200">
      <name>PCGCS131</name>
      <description>PCGCSlave 6</description>
      <baseAddress>0x5F93C000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="PCGCM200">
      <name>PCGCM130</name>
      <description>PCGC Master 5</description>
      <baseAddress>0x5F93D000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="LRCCONF200">
      <name>LRCCONF130</name>
      <description>LRCCONF 3</description>
      <baseAddress>0x5F93E000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="RESETINFO120">
      <name>RESETINFO130</name>
      <description>RESETINFO 1</description>
      <baseAddress>0x5F93E000</baseAddress>
      <alternatePeripheral>LRCCONF130</alternatePeripheral>
    </peripheral>
    <peripheral derivedFrom="PCGCM200">
      <name>PCGCM131</name>
      <description>PCGC Master 6</description>
      <baseAddress>0x5F93F000</baseAddress>
    </peripheral>
    <peripheral>
      <name>GRCCONF</name>
      <description>GRCCONF</description>
      <baseAddress>0x5F940000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GRCCONF_0</name>
        <value>320</value>
      </interrupt>
      <interrupt>
        <name>GRCCONF_1</name>
        <value>321</value>
      </interrupt>
      <interrupt>
        <name>GRCCONF_2</name>
        <value>322</value>
      </interrupt>
      <groupName>GRCCONF</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <dim>0x20</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>EVENTS_GRCPERIPH0[%s]</name>
          <description>Description collection: Event indicating that interrupt triggered for GRC peripheral identifier [n]</description>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVENTS_GRCPERIPH0</name>
              <description>Event indicating that interrupt triggered for GRC peripheral identifier [n]</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x20</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>EVENTS_GRCPERIPH1[%s]</name>
          <description>Description collection: Event indicating that interrupt triggered for GRC peripheral identifier [32 + n]</description>
          <addressOffset>0x180</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVENTS_GRCPERIPH1</name>
              <description>Event indicating that interrupt triggered for GRC peripheral identifier [32 + n]</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_SYSTEMOFFREADY</name>
          <description>Event indicating that the device is ready to go to System OFF</description>
          <addressOffset>0x200</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVENTS_SYSTEMOFFREADY</name>
              <description>Event indicating that the device is ready to go to System OFF</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_SYSTEMOFFNOTREADY</name>
          <description>Event indicating that the device is not ready to go to System OFF</description>
          <addressOffset>0x204</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVENTS_SYSTEMOFFNOTREADY</name>
              <description>Event indicating that the device is not ready to go to System OFF</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_SYSTEMOFFLOCALDOMAINOFF</name>
          <description>Event indicating that SYSTEMOFF is non-zero and all local power domains are powered off
        with the possible exception of Secure Domain depending on the value of
        SYSTEMOFF.SYSTEMOFFIGNORESECDOM.</description>
          <addressOffset>0x208</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EVENTS_SYSTEMOFFLOCALDOMAINOFF</name>
              <description>Event indicating that SYSTEMOFF is non-zero and all local power domains are powered off
        with the possible exception of Secure Domain depending on the value of
        SYSTEMOFF.SYSTEMOFFIGNORESECDOM.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
