adamkondraciuk/nrfx/mdk/nrf54h20_engb_sysctrl.svd
        <cluster>
          <name>GRCFORCEON</name>
          <description>Unspecified</description>
          <headerStructName>GRCCONF_GRCFORCEON</headerStructName>
          <access>read-write</access>
          <addressOffset>0x50C</addressOffset>
          <register>
            <name>MASK0</name>
            <description>Mask the active power domain request due to interrupt from GRC peripheral identifier [31:0]</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PERIPHID_0</name>
                <description>GRC peripheral identifier [0]</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [0] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [0] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_1</name>
                <description>GRC peripheral identifier [1]</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [1] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [1] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_2</name>
                <description>GRC peripheral identifier [2]</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [2] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [2] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_3</name>
                <description>GRC peripheral identifier [3]</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [3] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [3] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_4</name>
                <description>GRC peripheral identifier [4]</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [4] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [4] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_5</name>
                <description>GRC peripheral identifier [5]</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [5] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [5] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_6</name>
                <description>GRC peripheral identifier [6]</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [6] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [6] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_7</name>
                <description>GRC peripheral identifier [7]</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [7] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [7] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_8</name>
                <description>GRC peripheral identifier [8]</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [8] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [8] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_9</name>
                <description>GRC peripheral identifier [9]</description>
                <lsb>9</lsb>
                <msb>9</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [9] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [9] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_10</name>
                <description>GRC peripheral identifier [10]</description>
                <lsb>10</lsb>
                <msb>10</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [10] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [10] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_11</name>
                <description>GRC peripheral identifier [11]</description>
                <lsb>11</lsb>
                <msb>11</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [11] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [11] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_12</name>
                <description>GRC peripheral identifier [12]</description>
                <lsb>12</lsb>
                <msb>12</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [12] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [12] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_13</name>
                <description>GRC peripheral identifier [13]</description>
                <lsb>13</lsb>
                <msb>13</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [13] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [13] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_14</name>
                <description>GRC peripheral identifier [14]</description>
                <lsb>14</lsb>
                <msb>14</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [14] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [14] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_15</name>
                <description>GRC peripheral identifier [15]</description>
                <lsb>15</lsb>
                <msb>15</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [15] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [15] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_16</name>
                <description>GRC peripheral identifier [16]</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [16] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [16] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_17</name>
                <description>GRC peripheral identifier [17]</description>
                <lsb>17</lsb>
                <msb>17</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [17] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [17] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_18</name>
                <description>GRC peripheral identifier [18]</description>
                <lsb>18</lsb>
                <msb>18</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [18] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [18] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_19</name>
                <description>GRC peripheral identifier [19]</description>
                <lsb>19</lsb>
                <msb>19</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [19] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [19] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_20</name>
                <description>GRC peripheral identifier [20]</description>
                <lsb>20</lsb>
                <msb>20</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [20] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [20] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_21</name>
                <description>GRC peripheral identifier [21]</description>
                <lsb>21</lsb>
                <msb>21</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [21] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [21] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_22</name>
                <description>GRC peripheral identifier [22]</description>
                <lsb>22</lsb>
                <msb>22</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [22] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [22] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_23</name>
                <description>GRC peripheral identifier [23]</description>
                <lsb>23</lsb>
                <msb>23</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [23] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [23] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_24</name>
                <description>GRC peripheral identifier [24]</description>
                <lsb>24</lsb>
                <msb>24</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [24] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [24] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_25</name>
                <description>GRC peripheral identifier [25]</description>
                <lsb>25</lsb>
                <msb>25</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [25] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [25] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_26</name>
                <description>GRC peripheral identifier [26]</description>
                <lsb>26</lsb>
                <msb>26</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [26] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [26] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_27</name>
                <description>GRC peripheral identifier [27]</description>
                <lsb>27</lsb>
                <msb>27</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
