adamkondraciuk/nrfx/mdk/nrf54h20_engb_sysctrl.svd
                    <description>The GRC active power domain is kept On when GRC peripheral [32 + 22] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_23</name>
                <description>GRC peripheral identifier [23]</description>
                <lsb>23</lsb>
                <msb>23</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [32 + 23] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [32 + 23] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_24</name>
                <description>GRC peripheral identifier [24]</description>
                <lsb>24</lsb>
                <msb>24</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [32 + 24] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [32 + 24] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_25</name>
                <description>GRC peripheral identifier [25]</description>
                <lsb>25</lsb>
                <msb>25</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [32 + 25] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [32 + 25] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_26</name>
                <description>GRC peripheral identifier [26]</description>
                <lsb>26</lsb>
                <msb>26</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [32 + 26] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [32 + 26] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_27</name>
                <description>GRC peripheral identifier [27]</description>
                <lsb>27</lsb>
                <msb>27</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [32 + 27] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [32 + 27] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_28</name>
                <description>GRC peripheral identifier [28]</description>
                <lsb>28</lsb>
                <msb>28</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [32 + 28] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [32 + 28] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_29</name>
                <description>GRC peripheral identifier [29]</description>
                <lsb>29</lsb>
                <msb>29</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [32 + 29] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [32 + 29] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_30</name>
                <description>GRC peripheral identifier [30]</description>
                <lsb>30</lsb>
                <msb>30</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [32 + 30] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [32 + 30] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PERIPHID_31</name>
                <description>GRC peripheral identifier [31]</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>The GRC active power domain remain Off even when GRC peripheral [32 + 31] interrupt is active</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>The GRC active power domain is kept On when GRC peripheral [32 + 31] interrupt is active</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>METALFIX</name>
          <description>Unspecified</description>
          <headerStructName>GRCCONF_METALFIX</headerStructName>
          <access>read-write</access>
          <addressOffset>0x518</addressOffset>
          <register>
            <name>PDMAIN</name>
            <description>Register for possible metal-fix in GRC Main power domain</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VAL</name>
                <description>Value</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PDACT</name>
            <description>Register for possible metal-fix in GRC Active power domain</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VAL</name>
                <description>Value</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
