adamkondraciuk/nrfx/mdk/nrf54h20_engb_sysctrl.svd
          <register>
            <name>BIAS</name>
            <description>Internal bias generator trim</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VAL</name>
                <description>Internal bias generator trim</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PIXO</name>
            <description>PIXO high pulse supply trim</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VAL</name>
                <description>PIXO high pulse supply trim</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TRIMBUS</name>
            <description>Reserved trim bus</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VAL</name>
                <description>Value</description>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>MIRROR</name>
          <description>Enable LOCK for mirrored registers</description>
          <addressOffset>0x480</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>LOCK</name>
              <description>Lock for mirrored registers</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Lock disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Lock enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CLOAD</name>
          <description>Internal capacitive load</description>
          <addressOffset>0x484</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>VAL0</name>
              <description>Capacitive load value</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>VAL1</name>
              <description>Capacitive load value</description>
              <lsb>4</lsb>
              <msb>4</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>AMPLITUDECTRL</name>
          <description>Amplitude control</description>
          <addressOffset>0x488</addressOffset>
          <access>read-write</access>
          <resetValue>0x01000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>INTERVAL</name>
              <description>Amplitude check interval</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>STEP</name>
              <description>Step to adjust the IDAC when the peak detector triggers</description>
              <lsb>8</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>IDACINIT</name>
              <description>Initial IDAC code for the pierce oscillator</description>
              <lsb>16</lsb>
              <msb>20</msb>
            </field>
            <field>
              <name>PDCTRL</name>
              <description>Peak detector control</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Peak detector disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Peak detector enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PWRUPCTRL</name>
          <description>Power up control</description>
          <addressOffset>0x48C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CTRL</name>
              <description>Power up control</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Auto</name>
                  <description>Automatically handled by the peripheral</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PowerUp</name>
                  <description>Power up</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PowerDown</name>
                  <description>Power down</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MODE</name>
          <description>LFXO mode</description>
          <addressOffset>0x490</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>MODE</name>
              <description>Mode</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Pierce</name>
                  <description>Pierce mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pixo</name>
                  <description>PIXO mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ExternalSine</name>
                  <description>External sine wave clock</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ExternalSquare</name>
                  <description>External square wave clock</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HPMODE</name>
              <description>High performance mode</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable high performance mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable high performance mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <name>OVERRIDE</name>
          <description>Unspecified</description>
          <headerStructName>LFXO_OVERRIDE</headerStructName>
          <access>read-write</access>
          <addressOffset>0x500</addressOffset>
          <register>
            <name>PWRUP</name>
            <description>Override the PWRUP signal to the analog module</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VAL</name>
                <description>Override value for the signal</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>EN</name>
                <description>Enable the override</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Override is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Override is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RETAIN</name>
            <description>Override the RETAIN signal to the analog module</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VAL</name>
                <description>Override value for the signal</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>EN</name>
                <description>Enable the override</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Override is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Override is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>MODE</name>
            <description>Override the MODE signal to the analog module</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VAL</name>
                <description>Value</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>EN</name>
                <description>Enable the override</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Override is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Override is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>BYPASS</name>
            <description>Override the BYPASS signal to the analog module</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VAL</name>
                <description>Value</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>EN</name>
                <description>Enable the override</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Override is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Override is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>OUTSEL</name>
            <description>Override the OUTSEL[1:0] signal to the analog module</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VAL</name>
                <description>Value</description>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>EN</name>
                <description>Enable the override</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Override is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Override is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>S2SHPMODE</name>
            <description>Override the S2S_HPMODE signal to the analog module</description>
            <addressOffset>0x014</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VAL</name>
                <description>Value</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>EN</name>
                <description>Enable the override</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Override is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Override is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PIXOPWRUP</name>
            <description>Override the PIXO_PWRUP signal to the analog module</description>
            <addressOffset>0x018</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VAL</name>
                <description>Value</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>EN</name>
                <description>Enable the override</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Override is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Override is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PIXOSTARTUP</name>
            <description>Override the PIXO_STARTUP signal to the analog module</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VAL</name>
                <description>Value</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>EN</name>
                <description>Enable the override</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Override is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Override is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PIERCESTARTUP</name>
            <description>Override the PIERCE_STARTUP signal to the analog module</description>
            <addressOffset>0x020</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VAL</name>
                <description>Value</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>EN</name>
                <description>Enable the override</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Override is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Override is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PIERCEIDAC</name>
            <description>Override the PIERCE_IDAC signal to the analog module</description>
            <addressOffset>0x024</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VAL</name>
                <description>Value</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>EN</name>
                <description>Enable the override</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Override is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Override is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PDEN</name>
            <description>Override the PD_EN signal to the analog module</description>
            <addressOffset>0x028</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VAL</name>
                <description>Value</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>EN</name>
                <description>Enable the override</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Override is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Override is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CLOAD</name>
            <description>Override the CLOAD signal to the analog module</description>
            <addressOffset>0x02C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VAL</name>
                <description>Value</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>EN</name>
                <description>Enable the override</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Override is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Override is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
