adamkondraciuk/nrfx/mdk/nrf54h20_engb_sysctrl.svd
            <register>
              <name>SETTLED</name>
              <description>Override the CKSW16M SETTLED signal from the analog module</description>
              <addressOffset>0x010</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>VAL</name>
                  <description>Current value of the signal</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                </field>
                <field>
                  <name>EN</name>
                  <description>Enable the override</description>
                  <lsb>31</lsb>
                  <msb>31</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Override is disabled</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Override is enabled</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>CKSELOUT</name>
              <description>Override the CKSW16M CKSEL signal from the analog module</description>
              <addressOffset>0x014</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>VAL</name>
                  <description>Current value of the signal</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                </field>
                <field>
                  <name>EN</name>
                  <description>Enable the override</description>
                  <lsb>31</lsb>
                  <msb>31</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Override is disabled</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Override is enabled</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
        <cluster>
          <name>DFT</name>
          <description>Unspecified</description>
          <headerStructName>FLL16M_DFT</headerStructName>
          <access>read-write</access>
          <addressOffset>0x600</addressOffset>
          <cluster>
            <name>DCO16M</name>
            <description>Unspecified</description>
            <headerStructName>FLL16M_DFT_DCO16M</headerStructName>
            <access>read-write</access>
            <addressOffset>0x000</addressOffset>
            <register>
              <name>ATB0CONFIG</name>
              <description>Analog Test Bus 0 (ATB0) configuration</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>SELMUX</name>
                  <description>Select multiplexer for ATB0</description>
                  <lsb>0</lsb>
                  <msb>1</msb>
                </field>
                <field>
                  <name>EN</name>
                  <description>Enable the analog test bus</description>
                  <lsb>31</lsb>
                  <msb>31</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Analog test bus is disabled</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Analog test bus is enabled</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>ATB1CONFIG</name>
              <description>Analog Test Bus 1 (ATB1) configuration</description>
              <addressOffset>0x004</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>SELMUX</name>
                  <description>Select multiplexer for ATB1</description>
                  <lsb>0</lsb>
                  <msb>1</msb>
                </field>
                <field>
                  <name>EN</name>
                  <description>Enable the analog test bus</description>
                  <lsb>31</lsb>
                  <msb>31</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Analog test bus is disabled</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Analog test bus is enabled</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>DTB0CONFIG</name>
              <description>Digital Test Bus 0 (DTB0) configuration</description>
              <addressOffset>0x10</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>SELMUX</name>
                  <description>Select multiplexer for DTB0</description>
                  <lsb>0</lsb>
                  <msb>1</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>VSS</name>
                      <description>VSS selected</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>OSCDIV32INT</name>
                      <description>OSC_DIV32_INT_0V8 selected</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SETTLEDDCO16M</name>
                      <description>SETTLED_DCO16M_AO_0V8 selected</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>PWRUPDCO16M</name>
                      <description>PWRUP_DCO16M_AO_0V8 selected</description>
                      <value>0x3</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>EN</name>
                  <description>Enable the digital test bus</description>
                  <lsb>31</lsb>
                  <msb>31</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Digital test bus is disabled</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Digital test bus is enabled</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>DTB1CONFIG</name>
              <description>Digital Test Bus 1 (DTB1) configuration</description>
              <addressOffset>0x14</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>SELMUX</name>
                  <description>Select multiplexer for DTB1</description>
                  <lsb>0</lsb>
                  <msb>1</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>VSS</name>
                      <description>VSS selected</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>RETAINDCO16M</name>
                      <description>RETAIN_DCO16M_AO_0V8 selected</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SETTLEDDCO16M</name>
                      <description>SETTLED_DCO16M_AO_0V8 selected</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>OSCDCO16M</name>
                      <description>OSC_DCO16M_0V8 selected</description>
                      <value>0x3</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>EN</name>
                  <description>Enable the digital test bus</description>
                  <lsb>31</lsb>
                  <msb>31</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Digital test bus is disabled</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Digital test bus is enabled</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>DTB2CONFIG</name>
              <description>Digital Test Bus 2 (DTB2) configuration</description>
              <addressOffset>0x18</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>SELMUX</name>
                  <description>Select multiplexer for DTB2</description>
                  <lsb>0</lsb>
                  <msb>1</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>VSS</name>
                      <description>VSS selected</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SETTLEDDCO16M</name>
                      <description>SETTLED_DCO16M_AO_0V8 selected</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>READYDCO16M</name>
                      <description>READY_DCO16M_AO_0V8 selected</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>OSCDIV16INT</name>
                      <description>OSC_DIV16_INT_0V8 selected</description>
                      <value>0x3</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>EN</name>
                  <description>Enable the digital test bus</description>
                  <lsb>31</lsb>
                  <msb>31</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Digital test bus is disabled</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Digital test bus is enabled</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>DTB3CONFIG</name>
              <description>Digital Test Bus 3 (DTB3) configuration</description>
              <addressOffset>0x1C</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>SELMUX</name>
                  <description>Select multiplexer for DTB3</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>VSS</name>
                      <description>VSS selected</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SETTLEDDCO16M</name>
                      <description>SETTLED_DCO16M_AO_0V8 selected</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>PWRUPDELTEST</name>
                  <description>Enable the PWRUP delay test circuit</description>
                  <lsb>27</lsb>
                  <msb>27</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>PWRUP delay test circuit is disabled</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>PWRUP delay test circuit is enabled</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>EN</name>
                  <description>Enable the digital test bus</description>
                  <lsb>31</lsb>
                  <msb>31</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Digital test bus is disabled</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Digital test bus is enabled</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>TCFG</name>
              <description>Test mode configuration</description>
              <addressOffset>0x30</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>TURNOFFINTREG</name>
                  <description>Turn off internal regulator</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>MUTEOUTCLK</name>
                  <description>Mute output clock</description>
                  <lsb>1</lsb>
                  <msb>1</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>Spare</name>
                  <description>Spare</description>
                  <lsb>2</lsb>
                  <msb>2</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <name>CKSW16M</name>
            <description>Unspecified</description>
            <headerStructName>FLL16M_DFT_CKSW16M</headerStructName>
            <access>read-write</access>
            <addressOffset>0x040</addressOffset>
            <register>
              <name>DTBCONFIG</name>
              <description>Digital Test Bus configuration</description>
              <addressOffset>0x10</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>SELMUX</name>
                  <description>Select multiplexer for DTB</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>DTBSel0</name>
                      <description>DTB select 0</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DTBSel1</name>
                      <description>DTB select 1</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>PWRUPDELTEST</name>
                  <description>Enable the PWRUP delay test circuit</description>
                  <lsb>27</lsb>
                  <msb>27</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>PWRUP delay test circuit is disabled</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>PWRUP delay test circuit is enabled</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>DTB0EN</name>
                  <description>Enable digital test bus 0</description>
                  <lsb>28</lsb>
                  <msb>28</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Digital test bus is disabled</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Digital test bus is enabled</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>DTB1EN</name>
                  <description>Enable digital test bus 1</description>
                  <lsb>29</lsb>
                  <msb>29</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Digital test bus is disabled</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Digital test bus is enabled</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>DTB2EN</name>
                  <description>Enable digital test bus 2</description>
                  <lsb>30</lsb>
                  <msb>30</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Digital test bus is disabled</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Digital test bus is enabled</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
