adamkondraciuk/nrfx/mdk/nrf54h20_engb_sysctrl.svd
    <peripheral derivedFrom="GLOBAL_TWIM130">
      <name>GLOBAL_TWIM135</name>
      <description>I2C compatible Two-Wire Master Interface with EasyDMA 5</description>
      <baseAddress>0x5F9C6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM135</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL5</name>
        <value>454</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIS130">
      <name>GLOBAL_TWIS135</name>
      <description>I2C compatible Two-Wire Slave Interface with EasyDMA 5</description>
      <baseAddress>0x5F9C6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM135</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL5</name>
        <value>454</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_UARTE120">
      <name>GLOBAL_UARTE135</name>
      <description>UART with EasyDMA 6</description>
      <baseAddress>0x5F9C6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM135</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL5</name>
        <value>454</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="PPIB110">
      <name>PPIB136</name>
      <description>PPIB APB registers 9</description>
      <baseAddress>0x5F9CD000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="PCGCS200">
      <name>PCGCS137</name>
      <description>PCGCSlave 12</description>
      <baseAddress>0x5F9CE000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="PCGCM200">
      <name>PCGCM137</name>
      <description>PCGC Master 12</description>
      <baseAddress>0x5F9CF000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_DPPIC120">
      <name>GLOBAL_DPPIC136</name>
      <description>Distributed programmable peripheral interconnect controller 7</description>
      <baseAddress>0x5F9D1000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TIMER120">
      <name>GLOBAL_TIMER136</name>
      <description>Timer/Counter 8</description>
      <baseAddress>0x5F9D2000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>TIMER136</name>
        <value>466</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TIMER120">
      <name>GLOBAL_TIMER137</name>
      <description>Timer/Counter 9</description>
      <baseAddress>0x5F9D3000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>TIMER137</name>
        <value>467</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_PWM120">
      <name>GLOBAL_PWM133</name>
      <description>Pulse width modulation unit 4</description>
      <baseAddress>0x5F9D4000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>PWM133</name>
        <value>468</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM120">
      <name>GLOBAL_SPIM136</name>
      <description>Serial Peripheral Interface Master with EasyDMA 8</description>
      <baseAddress>0x5F9D5000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL6</name>
        <value>469</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIS120">
      <name>GLOBAL_SPIS136</name>
      <description>SPI Slave 7</description>
      <baseAddress>0x5F9D5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM136</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL6</name>
        <value>469</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIM130">
      <name>GLOBAL_TWIM136</name>
      <description>I2C compatible Two-Wire Master Interface with EasyDMA 6</description>
      <baseAddress>0x5F9D5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM136</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL6</name>
        <value>469</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIS130">
      <name>GLOBAL_TWIS136</name>
      <description>I2C compatible Two-Wire Slave Interface with EasyDMA 6</description>
      <baseAddress>0x5F9D5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM136</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL6</name>
        <value>469</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_UARTE120">
      <name>GLOBAL_UARTE136</name>
      <description>UART with EasyDMA 7</description>
      <baseAddress>0x5F9D5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM136</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL6</name>
        <value>469</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM120">
      <name>GLOBAL_SPIM137</name>
      <description>Serial Peripheral Interface Master with EasyDMA 9</description>
      <baseAddress>0x5F9D6000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL7</name>
        <value>470</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIS120">
      <name>GLOBAL_SPIS137</name>
      <description>SPI Slave 8</description>
      <baseAddress>0x5F9D6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM137</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL7</name>
        <value>470</value>
      </interrupt>
    </peripheral>
