adamkondraciuk/nrfx/mdk/nrf54h20_engb_sysctrl.svd
    <peripheral derivedFrom="GLOBAL_TWIM130">
      <name>GLOBAL_TWIM137</name>
      <description>I2C compatible Two-Wire Master Interface with EasyDMA 7</description>
      <baseAddress>0x5F9D6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM137</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL7</name>
        <value>470</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIS130">
      <name>GLOBAL_TWIS137</name>
      <description>I2C compatible Two-Wire Slave Interface with EasyDMA 7</description>
      <baseAddress>0x5F9D6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM137</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL7</name>
        <value>470</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_UARTE120">
      <name>GLOBAL_UARTE137</name>
      <description>UART with EasyDMA 8</description>
      <baseAddress>0x5F9D6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM137</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL7</name>
        <value>470</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="PPIB110">
      <name>PPIB137</name>
      <description>PPIB APB registers 10</description>
      <baseAddress>0x5F9DD000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="PCGCS200">
      <name>PCGCS138</name>
      <description>PCGCSlave 13</description>
      <baseAddress>0x5F9DE000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="PCGCM200">
      <name>PCGCM138</name>
      <description>PCGC Master 13</description>
      <baseAddress>0x5F9DF000</baseAddress>
    </peripheral>
  </peripherals>
</device>